# Задача 12: Петя и Катя – брат и сестра. Петя – студент, а Катя – школьница. Петя помогает Кате по математике.
# Он задумывает два натуральных числа X и Y (X,Y≤1000), а Катя должна их отгадать. Для этого Петя делает две подсказки. 
# Он называет сумму этих чисел S и их произведение P.
# Помогите Кате отгадать задуманные Петей числа.
#44 -> 22
#56 -> 23

x = int(input('Введите первое число: '))
y = int(input('Введите второе число: '))

number1 = x//2
number2 = y//2

print(number1,number2)




